[
  {
    "title": "Dice Visualizer",
    "start_month": "November",
    "start_year": 2022,
    "skills": [
      "Javascript",
      "HTML",
      "CSS"
    ],
    "description": "The Dice Visualizer is a web-based project that simulates dice rolls.  I developed this project for a Web Design class, handling all of the coding and logic. It was created to fulfill a class assignment and demonstrate web development skills.  Through this project, I improved my front-end development skills and learned to manage frustration and persevere through coding challenges.",
    "links": "https://ralmeida.dev/dice",
    "images": [],
    "tags": [
      "small"
    ]
  },
  {
    "title": "Minas Gerais Tourism",
    "start_month": "March",
    "start_year": 2022,
    "skills": [
      "Django",
      "Python",
      "Bootstrap",
      "Ajax",
      "Javascript",
      "HTML",
      "CSS"
    ],
    "description": "The Minas Gerais Tourism project is a web application similar to a simplified version of TripAdvisor, designed to promote tourism in Minas Gerais, Brazil. I was the sole developer, responsible for all aspects of the project, from learning Django to implementing the front-end and back-end.  It was created for the NJ FBLA Coding & Programming 2022 competition. This project significantly enhanced my web development skills, particularly in using Python web frameworks and managing a large-scale project independently.",
    "links": "https://ralmeida.dev/mg_tourism",
    "images": [
      "/images/mg_tourism.png"
    ],
    "tags": [
      "large"
    ]
  },
  {
    "title": "Peru Spanish Project",
    "start_month": "June",
    "start_year": 2022,
    "skills": [
      "Django",
      "Python",
      "Bootstrap",
      "Ajax",
      "Javascript",
      "HTML",
      "CSS"
    ],
    "description": "The Peru Spanish Project is a web application that explores Peruvian history, customs, and places through an interactive timeline. I adapted code from my previous MG Tourism project to create this, handling all development aspects.  It was created as a final project for my Spanish III class. This project reinforced my Django skills and demonstrated my ability to adapt existing code for new purposes.",
    "links": "https://ralmeida.dev/peru",
    "images": [
      "/images/peru.png"
    ],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "Beauty and the Chic Webdeisgn Project",
    "start_month": "November",
    "start_year": 2022,
    "skills": [
      "Next.js",
      "Javascript",
      "HTML",
      "CSS",
      "TypeScript",
      "SCSS"
    ],
    "description": "The Beauty and the Chic project is a website for a salon, featuring a gallery, worker descriptions, and a list of services. I am working on the database and making it so the owner can dynamically edit the website's text. This is a group project for my web design class, aimed at providing practical experience with client-based web development.  This project is teaching me about collaborative web development, database management, and creating dynamic, user-editable content.",
    "links": null,
    "images": [],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "Capstone Computational Thinking Project",
    "start_month": "December",
    "start_year": 2022,
    "skills": [
      "Django",
      "Next.js",
      "Python",
      "Ant Design",
      "TypeScript",
      "HTML",
      "CSS"
    ],
    "description": "The Capstone Computational Thinking Project is a custom tool designed to collect data for a research experiment correlating code reading and computational thinking skills. I initially built the project entirely in Next.js, but later rebuilt the backend with Django Rest Framework and the frontend with Next.js and Ant Design, with significant assistance from my cousin.  The tool is used to conduct my Capstone Research experiment, involving pretests, posttests, code reading, and peer-review activities. This project taught me the importance of choosing the right frameworks, the value of mentorship, and the benefits of refactoring code for improved structure and efficiency.",
    "links": "https://ralmeida.dev/capstone",
    "images": [
      "/images/capstone.png"
    ],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "Update: Capstone Computational Thinking Project",
    "start_month": "February",
    "start_year": 2023,
    "skills": [
      "Django",
      "Next.js",
      "Python",
      "Ant Design",
      "TypeScript",
      "HTML",
      "CSS",
      "Prisma"
    ],
    "description": "This is an update to the Capstone Computational Thinking Project, detailing significant changes to the project's structure. I collaborated with my cousin, a software engineer, to rebuild the project from scratch, switching the backend to Django Rest Framework and using Ant Design for the frontend. The purpose of this update was to improve the project's architecture and scalability. Through this collaboration, I learned about backend frameworks, frontend design libraries, and the value of expert guidance in software development.",
    "links": "https://ralmeida.dev/capstone",
    "images": [],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "Event Manager",
    "start_month": "March",
    "start_year": 2023,
    "skills": [
      "Django",
      "Next.js",
      "GraphQL",
      "Python",
      "TypeScript",
      "HTML",
      "CSS"
    ],
    "description": "Event Manager is a web application designed to increase student involvement in school events. I was the sole developer, responsible for creating features like a personalized calendar, group creation, event search, a points shop, an admin page, a leaderboard, and an interactive help page with OpenAI API integration.  It was created for the 2023 FBLA Coding & Programming Competition.  This project significantly expanded my full-stack development skills and taught me about project management, competition strategy, and the importance of reflection.",
    "links": "https://drive.google.com/drive/folders/1txaHZD2JNFESvQmFJpQGpbzGv2tBOBL8?usp=share_link",
    "images": [
      "/images/fbla2023.jpg"
    ],
    "tags": [
      "large"
    ]
  },
  {
    "title": "Black History Month Project",
    "start_month": "February",
    "start_year": 2023,
    "skills": [
      "Next.js",
      "PM2",
      "Apache",
      "Linux",
      "Javascript",
      "HTML",
      "CSS"
    ],
    "description": "The Black History Month Project is a website compiling individual websites on significant African American figures. I led the project, collecting and integrating everyone's work, and designed the homepage using Next.js. It was created as a class project for my web design class. This project taught me about team leadership, project management, and the artistic aspects of coding.",
    "links": "https://ralmeida.dev/bhm",
    "images": [
      "/images/bhm1.png",
      "/images/bhm2.png"
    ],
    "tags": [
      "small"
    ]
  },
  {
    "title": "UCVTS-Madness Website",
    "start_month": "April",
    "start_year": 2023,
    "skills": [
      "Next.js",
      "Google Sheets API",
      "Bootstrap",
      "Javascript",
      "HTML",
      "CSS"
    ],
    "description": "The UCVTS-Madness Website is a site for a school basketball tournament, featuring a live bracket, odds voting system, team information, and a user pick accuracy leaderboard. I developed the entire website, including its connection to a Google Sheet for live updates.  It was created for the UCVTS-Madness event hosted by the Black Student Union at my school. This project enhanced my skills in using APIs, working with binary trees, and deploying a live, dynamic website.",
    "links": "http://ralmeida.dev/ucvts-madness",
    "images": [
      "/images/ucvts-madness.png",
      "/images/ap-rally.jpg",
      "/images/ucvts-madness1.jpg",
      "/images/ucvts-madness2.jpg"
    ],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "QuickDeets",
    "start_month": "October",
    "start_year": 2024,
    "skills": [
      "Python",
      "Django",
      "Javascript",
      "HTML",
      "CSS",
      "Whisper API",
      "ChatGPT API"
    ],
    "description": "QuickDeets is a web app designed to reduce patient harm events in hospitals by improving data accessibility and sharing among healthcare practitioners. I developed the project solo, integrating Whisper for voice-automated note-taking and a large language model for categorizing patient data. It was created over 36 hours for HackHarvard 2024. This project deepened my understanding of healthcare technology, API integration, and rapid prototyping.",
    "links": "https://devpost.com/software/quickdeets",
    "images": [],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "SpeedRead",
    "start_month": "October",
    "start_year": 2023,
    "skills": [
      "SwiftUI",
      "Swift",
      "ChatGPT API"
    ],
    "description": "SpeedRead is an iPad note-taking app that enhances the reading and annotation experience for PDFs with tight margins and line spacing. I was the sole developer, using SwiftUI and PencilKit, and integrating a large language model for highlighting important lines. It was developed during the 2023 HackHarvard. This project improved my skills in iOS development, UI/UX design, and working with large language models.",
    "links": "https://devpost.com/software/speedread-f8pr21",
    "images": [],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "WebTune",
    "start_month": "March",
    "start_year": 2024,
    "skills": [
      "Python",
      "Django",
      "Gemini API",
      "React"
    ],
    "description": "WebTune is a Django package that provides abstract database models to generate SEO-optimized data for website objects. I developed this package, leveraging an LLM to analyze data points and generate JSON-LD and image alt text. It was created during HackPrinceton 2024. This project enhanced my understanding of SEO, Django development, and creating reusable software components.",
    "links": "https://devpost.com/software/webtune-k5bd60",
    "images": [],
    "tags": [
      "medium"
    ]
  },
  {
    "title": " MeatCode",
    "start_month": "September",
    "start_year": 2024,
    "skills": [
      "Django",
      "Python",
      "Convex",
      "React"
    ],
    "description": "MeatCode is a platform that presents LeetCode-style problems with bugs, challenging users to fix the code or identify the question based on a correct solution. I worked with teammates to develop this platform, focusing on creating a novel approach to coding interview preparation. It was created during HackMIT 2024. This project taught me about collaborative software development and exploring alternative approaches to established practices.",
    "links": "https://ballot.hackmit.org/project/vjrrm-deymt-jplvb-lxrfd",
    "images": [],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "Beeline Reader Editor",
    "start_month": "September",
    "start_year": 2024,
    "skills": [
      "HTML",
      "CSS",
      "Javascript"
    ],
    "description": "The Beeline Reader Editor is a tool to improve the readability of PDFs by converting them to HTML, adjusting margins and line spacing, and converting them back to PDF. I created this project to enhance accessibility at my school. It was created to address the issue of PDFs with tight margins and line spacing. This project reinforced my understanding of web technologies and accessibility.",
    "links": "https://ralmeida.dev/beeline-editor/",
    "images": [],
    "tags": [
      "small"
    ]
  },
  {
    "title": "AP Statistics TI 84 Helper",
    "start_month": "June",
    "start_year": 2023,
    "skills": [
      "Python"
    ],
    "description": "The AP Statistics TI 84 Helper is a Python program for the TI 84 Python edition calculator that provides guidance on solving statistics problems based on keywords. I developed the entire program, including the efficient search algorithms and data compression system. It was created as my final project for my AP Statistics class. This project challenged me to work within the constraints of a limited device and taught me about efficient algorithm design and data compression.",
    "links": null,
    "images": [],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "SAT Helper",
    "start_month": "November",
    "start_year": 2023,
    "skills": [
      "TI-Basic"
    ],
    "description": "The SAT Helper is a TI-Basic application for the TI 84 calculator designed to assist with the math section of the SAT. I developed this application, learning TI-Basic in a short timeframe. It was created after I found a poorly made, paid alternative. This project taught me about rapid skill acquisition and creating practical tools under pressure.",
    "links": "https://github.com/rafaelolal/ti84",
    "images": [],
    "tags": [
      "small"
    ]
  },
  {
    "title": "Stock Decision Metric APIs at Citadel",
    "start_month": "June",
    "start_year": 2024,
    "skills": [
      "Python",
      "Django",
      "HTML",
      "CSS",
      "Yahoo API",
      "Gemini API"
    ],
    "description": "The Stock Decision Metric APIs project consists of APIs that analyze stock data using custom implementations of decision metrics like RSI and Bollinger Bands to make buy/sell decisions. I developed the APIs and the connected frontend, integrating the Yahoo Finance API for data retrieval. It was created as my final project at the 2024 Citadel Externship. This project deepened my understanding of financial metrics, API development, and full-stack application development.",
    "links": "https://github.com/rafaelolal/citadel_final",
    "images": [],
    "tags": [
      "small"
    ]
  },
  {
    "title": "Scheduling Bot at AiGoLearning",
    "start_month": "March",
    "start_year": 2022,
    "skills": [
      "Python",
      "Discord API"
    ],
    "description": "The Scheduling Bot is a Discord bot that automates the scheduling of teacher evaluations at AiGoLearning. I developed the bot to manage roles, handle availability requests, and coordinate communication between new teachers and evaluators. It was created to streamline the teacher evaluation process at AiGoLearning. This project improved my skills in bot development, API integration, and automating organizational processes.",
    "links": "https://github.com/rafaelolal/scheduling_bot",
    "images": [],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "CH Hardwood Floors",
    "start_month": "April",
    "start_year": 2024,
    "skills": [
      "Next.js",
      "TypeScript",
      "HTML",
      "SCSS"
    ],
    "description": "CH Hardwood Floors is a website for a local flooring contracting business. I was responsible for the entire project lifecycle, from ideation to deployment and iteration, including SEO optimization. It was created to boost the online presence and attract new customers for the business. This project significantly enhanced my communication, project management, and SEO skills, and provided experience in delivering a real-world, impactful product.",
    "links": "https://chhardwoodfloor.com",
    "images": [],
    "tags": [
      "medium"
    ]
  },
  {
    "title": "Art Gallery Problem",
    "start_month": "October",
    "start_year": 2024,
    "skills": [
      "C++",
      "OpenGL"
    ],
    "description": "The Art Gallery Problem project is a C++ program using OpenGL that allows users to create polygons and place guards to visualize the art gallery problem in computational geometry. I implemented the program, applying concepts like segment intersection and point-in-polygon tests. It was created as the 5th project in my Computational Geometry class. This project deepened my understanding of computational geometry algorithms and C++ programming.",
    "links": "https://github.com/bowdoin-compgeom-f24/guard-chair",
    "images": [
      "/images/gallery.png"
    ],
    "tags": [
      "small"
    ]
  },
  {
    "title": "Maze Bot",
    "start_month": "February",
    "start_year": 2022,
    "skills": [
      "Python",
      "Discord API"
    ],
    "description": "The Maze Bot is a Discord bot that allows users to challenge each other to solve mazes within Discord's messaging system. I developed the bot, including the maze generation and interaction logic. It was created for a competition in my school's Coding Club. This project enhanced my skills in bot development, game design, and object-oriented programming.",
    "links": "https://github.com/rafaelolal/aigocode_bot/tree/master",
    "images": [
      "/images/maze_bot.png"
    ],
    "tags": [
      "small"
    ]
  },
  {
    "title": "AiGoCode Bot",
    "start_month": "December",
    "start_year": 2022,
    "skills": [
      "Python",
      "Discord API"
    ],
    "description": "The AiGoCode Bot is a Discord bot created for AiGoLearning, integrating features from the AiGoCode website and providing additional games and functionalities. I led the development of the bot, managing a team of two others working on the website. It was created to enhance the AiGoCode initiative and support the organization's hackathon on Discord.  This project improved my leadership, project management, and large-scale bot development skills.",
    "links": "https://github.com/rafaelolal/aigocode_bot",
    "images": [],
    "tags": [
      "large"
    ]
  }
]